/*
 * Copyright (c) 2022, Artinchip Technology Co., Ltd
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _ARTINCHIP_AIC_MAC_REG_H_
#define _ARTINCHIP_AIC_MAC_REG_H_

#ifdef __cplusplus
extern "C" {
#endif

/**
  * AICMAC Registers Offset
  */

typedef struct
{
    uint32_t macconf;      /* 0x0000 MAC_CONF */
    uint32_t dma0conf;     /* 0x0004 DMA0_CONF */
    uint32_t dma1conf;     /* 0x0008 DMA1_CONF */
    uint32_t dma0intsts;   /* 0x000C DMA0_INT_STS */
    uint32_t dma0inten;    /* 0x0010 DMA0_INT_EN */
    uint32_t dma1intsts;   /* 0x0014 DMA1_INT_STS */
    uint32_t dma1inten;    /* 0x0018 DMA1_INT_EN */
    uint32_t mactxfunc;    /* 0x001C MAC_TX_FUNC */
    uint32_t macrxfunc;    /* 0x0020 MAC_RX_FUNC */
    uint32_t txdma0ctl;    /* 0x0024 TX_DMA0_CTL */
    uint32_t rxdma0ctl;    /* 0x0028 RX_DMA0_CTL */
    uint32_t txdma1ctl;    /* 0x002C TX_DMA1_CTL */
    uint32_t rxdma1ctl;    /* 0x0030 RX_DMA1_CTL */
    uint32_t flowctl;      /* 0x0034 FLOW_CTL */
    uint32_t vlantag;      /* 0x0038 VLAN_TAG */
    uint32_t vlanflt;      /* 0x003C VLAN_FLT */
    uint32_t macfrmflt;    /* 0x0040 MAC_FRM_FLT */
    uint32_t hashtblhigh;  /* 0x0044 HASH_TBL_HIGH */
    uint32_t hashtbllow;   /* 0x0048 HASH_TBL_LOW */
    uint32_t vlanhashtbl;  /* 0x004C VLAN_HASH_TBL */
    uint32_t macaddr0high; /* 0x0050 MAC_ADDR0_HIGH */
    uint32_t macaddr0low;  /* 0x0054 MAC_ADDR0_LOW */
    uint32_t macaddr1high; /* 0x0058 MAC_ADDR1_HIGH */
    uint32_t macaddr1low;  /* 0x005C MAC_ADDR1_LOW */
    uint32_t macaddr2high; /* 0x0060 MAC_ADDR2_HIGH */
    uint32_t macaddr2low;  /* 0x0064 MAC_ADDR2_LOW */
    uint32_t macaddr3high; /* 0x0068 MAC_ADDR3_HIGH */
    uint32_t macaddr3low;  /* 0x006C MAC_ADDR3_LOW */
    uint32_t macaddr4high; /* 0x0070 MAC_ADDR4_HIGH */
    uint32_t macaddr4low;  /* 0x0074 MAC_ADDR4_LOW */
    uint32_t macaddr5high; /* 0x0078 MAC_ADDR5_HIGH */
    uint32_t macaddr5low;  /* 0x007C MAC_ADDR5_LOW */
    uint32_t macaddr6high; /* 0x0080 MAC_ADDR6_HIGH */
    uint32_t macaddr6low;  /* 0x0084 MAC_ADDR6_LOW */
    uint32_t macaddr7high; /* 0x0088 MAC_ADDR7_HIGH */
    uint32_t macaddr7low;  /* 0x008C MAC_ADDR7_LOW */
    uint32_t mdioctl;      /* 0x0090 MDIO_CTL */
    uint32_t mdiodata;     /* 0x0094 MDIO_DATA */
    uint32_t RESERVED0[2];
    uint32_t debugreg; /* 0x00A0 DEBUG_REG */
    uint32_t rgmiists; /* 0x00A4 RGMII_STS */
    uint32_t RESERVED1[2];
    uint32_t txdma0descstart;  /* 0x00B0 TXDMA0_DESC_START */
    uint32_t rxdma0descstart;  /* 0x00B4 RXDMA0_DESC_START */
    uint32_t curtxdma0desc;    /* 0x00B8 CUR_TXDMA0_DESC */
    uint32_t currxdma0desc;    /* 0x00BC CUR_RXDMA0_DESC */
    uint32_t curtxdma0bufaddr; /* 0x00C0 CUR_TXDMA0_BUFADDR */
    uint32_t currxdma0bufaddr; /* 0x00C4 CUR_RXDMA0_BUFADDR */
    uint32_t RESERVED2[2];
    uint32_t txdma1descstart;  /* 0x00D0 TXDMA1_DESC_START */
    uint32_t rxdma1descstart;  /* 0x00D4 RXDMA1_DESC_START */
    uint32_t curtxdma1desc;    /* 0x00D8 CUR_TXDMA1_DESC */
    uint32_t currxdma1desc;    /* 0x00DC CUR_RXDMA1_DESC */
    uint32_t curtxdma1bufaddr; /* 0x00E0 CUR_TXDMA1_BUFADDR */
    uint32_t currxdma1bufaddr; /* 0x00E4 CUR_RXDMA1_BUFADDR */
    uint32_t dma0misfrmbufovf; /* 0x00E8 DMA0_MISFRM_BUFOVF */
    uint32_t dma1misfrmbufovf; /* 0x00EC DMA1_MISFRM_BUFOVF */
    uint32_t RESERVED3[4];
    uint32_t tmstmpctl;       /* 0x0100 TMSTMP_CTL */
    uint32_t subsecincr;      /* 0x0104 SUB_SEC_INCR */
    uint32_t tmsmpaddend;     /* 0x0108 TMSMP_ADDEND */
    uint32_t systimesec;      /* 0x010C SYS_TIME_SEC */
    uint32_t systimenanosec;  /* 0x0110 SYS_TIME_NANO_SEC */
    uint32_t updttimesec;     /* 0x0114 UPDT_TIME_SEC */
    uint32_t updttimenanosec; /* 0x0118 UPDT_TIME_NANO_SEC */
    uint32_t trgttimesec;     /* 0x011C TRGT_TIME_SEC */
    uint32_t trgttimenanosec; /* 0x0120 TRGT_TIME_NANO_SEC */
    uint32_t auxtmsmpsec;     /* 0x0124 AUX_TMSMP_SEC */
    uint32_t auxtmsmpnanosec; /* 0x0128 AUX_TMSMP_NANO_SEC */
    uint32_t systimehisec;    /* 0x012C SYS_TIME_HI_WORD_SEC */
    uint32_t tmsmpsts;        /* 0x0130 TMSMP_STS */
    uint32_t ppsctl;          /* 0x0134 PPS_CTL */
    uint32_t pps0interval;    /* 0x0138 PPS0_INTERVAL */
    uint32_t pps0width;       /* 0x013C PPS0_WIDTH */
    uint32_t avmacctl;        /* 0x0140 AV_MAC_CTL */
    uint32_t ch1slotctlsts;   /* 0x0144 CH1_SLOT_CTL_STS */
    uint32_t ch1cbsctl;       /* 0x0148 CH1_CBS_CTL */
    uint32_t ch1cbssts;       /* 0x014C CH1_CBS_STS */
    uint32_t ch1idleslopcred; /* 0x0150 CH1_IDLE_SLOP_CRED */
    uint32_t ch1sendslopcred; /* 0x0154 CH1_SEND_SLOP_CRED */
    uint32_t ch1hicred;       /* 0x0158 CH1_HI_CRED */
    uint32_t ch1locred;       /* 0x015C CH1_LO_CRED */
    uint32_t RESERVED4[0x3A7];
    uint32_t version; /* 0x0FFC VERSION */
} aicmac_reg_t;

/*----------------------------------------------------------------------------*/
/* AICMAC Registers bits definitions                                          */
/*----------------------------------------------------------------------------*/

/* 0x0000 macconf: Bit definition for MAC Config Reg0 */
#define ETH_MACCONF_LUD           ((uint32_t)0x00000100) /* 0x0000.8: Link Up or Down */
#define ETH_MACCONF_IPC           ((uint32_t)0x00000080) /* 0x0000.7: IP Checksum offload */
#define ETH_MACCONF_PRELEN_MSK    ((uint32_t)0x00000060) /* 0x0000.5-6: Preamble Length for Transmit frames */
#define ETH_MACCONF_PRELEN_7BYTES ((uint32_t)0x00000000)
#define ETH_MACCONF_PRELEN_5BYTES ((uint32_t)0x00000020)
#define ETH_MACCONF_PRELEN_3BYTES ((uint32_t)0x00000040)
#define ETH_MACCONF_DM            ((uint32_t)0x00000010) /* 0x0000.4: Duplex mode */
#define ETH_MACCONF_LM            ((uint32_t)0x00000008) /* 0x0000.3: loopback mode */
